In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.3.3'

In [3]:
index = ['eggs', 'apples', 'milk', 'bread']
data = [30, 6, 'Yes', 'No']

In [6]:
ser = pd.Series(data=data, index=index)

In [7]:
type(ser)

pandas.core.series.Series

In [8]:
ser.shape

(4,)

In [9]:
ser.values

array([30, 6, 'Yes', 'No'], dtype=object)

In [10]:
ser.index

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [11]:
ser.size

4

In [12]:
ser.dtype

dtype('O')

In [13]:
ser.value_counts()

30     1
6      1
Yes    1
No     1
Name: count, dtype: int64

In [15]:
# 시리즈의 차원
ser.ndim

1

In [16]:
ser

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [19]:
type(ser['eggs'])

int

In [20]:
ser['eggs']

30

In [22]:
# 여러개를 가져올 때, 리스트로 지정
ser[['eggs', 'bread']]

eggs     30
bread    No
dtype: object

In [21]:
type(ser[['eggs', 'bread']])

pandas.core.series.Series

In [24]:
# 인덱스가 인접해 있을 경우 : 범위 지정, 리스트 x
ser['eggs': 'bread']

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [25]:
# dd : 셀 삭제하기
# z : 이전으로 되돌리기

## 산술 연산자

In [26]:
index = ['apples', 'oranges', 'bananas']
data = [10, 6, 3,]

In [27]:
fruits = pd.Series(data=data, index=index)
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [28]:
fruits.values

array([10,  6,  3])

In [29]:
fruits.index

Index(['apples', 'oranges', 'bananas'], dtype='object')

In [30]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [31]:
# 과일을 모두 5개씩 더 들여왔다. 
fruits_plus5 = fruits+5
fruits_plus5

apples     15
oranges    11
bananas     8
dtype: int64

In [32]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [33]:
fruits['oranges'] = fruits['oranges']-2
fruits

apples     10
oranges     4
bananas     3
dtype: int64

In [34]:
fruits[['apples', 'bananas']] = fruits[['apples', 'bananas']] + 3
fruits

apples     13
oranges     4
bananas     6
dtype: int64

In [37]:
distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]
planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']
dist_planets = pd.Series(data = distance_from_sun, index = planets)

In [38]:
import pandas as pd

In [39]:
dist_planets

Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64

In [41]:
c= 18
time_light = dist_planets /c
time_light

Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64

In [44]:
close_planets = time_light[time_light < 40]
close_planets

Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

# Pandas Dataframe

In [45]:
import pandas as pd
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

In [46]:
type(items)

dict

In [47]:
df = pd.DataFrame(data = items)
df

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [48]:
df.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [51]:
type(df.values)

numpy.ndarray

In [49]:
df.shape

(5, 2)

In [50]:
df.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [52]:
df.columns

Index(['Bob', 'Alice'], dtype='object')

In [53]:
df.size

10

In [56]:
type(df.columns)

pandas.core.indexes.base.Index

In [59]:
# 요소의 갯수
df.size

10

In [58]:
# df의 차원 확인
df.ndim

2

In [ ]:
# 행의 갯수
len(df)

In [61]:
df.value_counts()

Bob    Alice
25.0   45.0     1
245.0  500.0    1
Name: count, dtype: int64

In [63]:
type(df.value_counts())

pandas.core.series.Series

In [64]:
df_val = df.value_counts()
df_val.index

MultiIndex([( 25.0,  45.0),
            (245.0, 500.0)],
           names=['Bob', 'Alice'])

In [65]:
pd.DataFrame(data=data)
pd.DataFrame(data)

    0
0  10
1   6
2   3

In [62]:
df

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

## csv 파일을 로딩 -> df 만들기

In [70]:
data_path = './datas/avocado.csv'
# datas/avocado.csv
# index_col =1 디폴트 1, 인덱스를 제외시키려면 0으로 명시
pd.read_csv(data_path,index_col=1)

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
Date,,,,,,,,,,,,,
2015-12-27,0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
2015-12-20,1,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2015-12-13,2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
2015-12-06,3,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
2015-11-29,4,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2018-02-04,7,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
2018-01-28,8,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
2018-01-21,9,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
2018-01-14,10,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
2018-01-07,11,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

## Accessing Elements in Pandas DataFrames

In [71]:
import pandas as pd

In [72]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

In [76]:
# 인덱스를 따로 지정하지 않으면, 파이썬의 기본 인덱스인 0~ 시작하는 숫자로 셋팅됨

df = pd.DataFrame(data=items2, index=['store1', 'store2'])
df.head()

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0

In [77]:
# 판다스의 데이터에서 데이터를 억세스하는 3가지 방법.
# 1. 컬럼의 값을 가져오는 방법 => 변수명 오른쪽에 대괄호를 쓰고, 컬럼명을 적는다.

In [78]:
df['pants']

store1    30
store2     5
Name: pants, dtype: int64

In [79]:
type(df['pants'])

pandas.core.series.Series

In [80]:
df[['pants','watches']]

        pants  watches
store1     30       35
store2      5       10

In [83]:
# pants, watches, glasses
df[['pants','watches','glasses']]

        pants  watches  glasses
store1     30       35      NaN
store2      5       10     50.0

In [84]:
# 데이터 프레임에서 데이터 억세스하는 두번째 방법
# 2. 사람용 인덱스와 컬럼명으로 데이터를 가져오는 방법
#  변수명.loc[,]  <= location 
#  변수명.iloc[,] <= index location

In [85]:
df

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0

In [90]:
# df.loc[범위지정]
# df.loc[행범위, 열범위]
# df.loc['pants' : 'glasses'] 행 인덱스로 인식함
df.loc[:, 'pants' : 'glasses']

        pants  watches  glasses
store1     30       35      NaN
store2      5       10     50.0

In [91]:
df.loc['store1','watches']

np.int64(35)

In [95]:
df.iloc[0, 2:3+1]

watches    35.0
glasses     NaN
Name: store1, dtype: float64

In [96]:
df.loc['store1': 'store2','pants': 'glasses']

        pants  watches  glasses
store1     30       35      NaN
store2      5       10     50.0

In [97]:
# df.loc['store1': 'store2','pants': 'glasses']
# 위 데이터 추출을 df.iloc로 추출

In [101]:
df.iloc[0:2, 1:4]

        pants  watches  glasses
store1     30       35      NaN
store2      5       10     50.0

In [105]:
# df.iloc[행_start_index : 헹_stop_index, 열_start_index : 열_stop_index]
# df.iloc[0:n+1, 1:n+1]
# df.iloc[0:1+1, 1:3+1]
# df.iloc[0:1+1, 1:]
df.iloc[0:, 1:]

        pants  watches  glasses
store1     30       35      NaN
store2      5       10     50.0

In [106]:
# 특정 요소 read(읽기, 참조)
# df.iloc[행인덱스, 열인덱스]
df.iloc[0,1]

np.int64(30)

In [107]:
df.iloc[0, 1:]

pants      30.0
watches    35.0
glasses     NaN
Name: store1, dtype: float64

In [109]:
df.iloc[0,[1,2,3]]

pants      30.0
watches    35.0
glasses     NaN
Name: store1, dtype: float64

## 데이터에 값 바꾸기

In [110]:
df

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0

In [111]:
df.loc['store2', 'pants'] =20

In [112]:
df

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15     20       10     50.0

In [113]:
df['shirts'] = [15,2]
df

        bikes  pants  watches  glasses  shirts
store1     20     30       35      NaN      15
store2     15     20       10     50.0       2

In [114]:
df['suits'] = df['pants'] + df['shirts']
df

        bikes  pants  watches  glasses  shirts  suits
store1     20     30       35      NaN      15     45
store2     15     20       10     50.0       2     22

## Loading Data into a Pandas DataFrame

In [4]:
import pandas as pd

In [8]:
data_path = 'datas/GOOG.csv'
df = pd.read_csv(data_path) # csv 파일을 로딩 -> df를 만듦
df

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,49.676899,51.693783,47.669952,49.845802,49.845802,44994500
1,2004-08-20,50.178635,54.187561,49.925285,53.805050,53.805050,23005800
2,2004-08-23,55.017166,56.373344,54.172661,54.346527,54.346527,18393200
3,2004-08-24,55.260582,55.439419,51.450363,52.096165,52.096165,15361800
4,2004-08-25,52.140873,53.651051,51.604362,52.657513,52.657513,9257400
...,...,...,...,...,...,...,...
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

In [9]:
# df에 몇개 있고, nan(null)이 있는지 확인
df.info

<bound method DataFrame.info of             Date        Open        High         Low       Close   Adj Close  \
0     2004-08-19   49.676899   51.693783   47.669952   49.845802   49.845802
1     2004-08-20   50.178635   54.187561   49.925285   53.805050   53.805050
2     2004-08-23   55.017166   56.373344   54.172661   54.346527   54.346527
3     2004-08-24   55.260582   55.439419   51.450363   52.096165   52.096165
4     2004-08-25   52.140873   53.651051   51.604362   52.657513   52.657513
...          ...         ...         ...         ...         ...         ...
3308  2017-10-09  980.000000  985.424988  976.109985  977.000000  977.000000
3309  2017-10-10  980.000000  981.570007  966.080017  972.599976  972.599976
3310  2017-10-11  973.719971  990.710022  972.250000  989.250000  989.250000
3311  2017-10-12  987.450012  994.119995  985.000000  987.830017  987.830017
3312  2017-10-13  992.000000  997.210022  989.000000  989.679993  989.679993

        Volume
0     44994500
1     23005800
2     18393200
3     15361800
4      9257400
...        ...
3308    891400
3309    968400
3310   1693300
3311   1262400
3312   1157700

[3313 rows x 7 columns]>

In [11]:
# df 기술 통계 확인
df.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [14]:
df.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

# 집계함수

In [15]:
data_path = 'datas/fake_company.csv'
df = pd.read_csv(data_path)
df.head(3)

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000

In [18]:
import numpy as np
# df.describe(include=[np.number])
df.describe(exclude=[np.number])

         Name Department
count       9          9
unique      3          3
top     Alice         HR
freq        3          3

In [16]:
df.describe()

              Year        Age        Salary
count     9.000000   9.000000      9.000000
mean   1991.000000  34.333333  54333.333333
std       0.866025   9.055385   5147.815070
min    1990.000000  25.000000  48000.000000
25%    1990.000000  27.000000  50000.000000
50%    1991.000000  31.000000  52000.000000
75%    1992.000000  45.000000  60000.000000
max    1992.000000  47.000000  62000.000000

## 중복데이터

In [20]:
df

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991    Alice         HR   26   52000
4  1991      Bob         RD   31   50000
5  1991  Charlie      Admin   46   60000
6  1992    Alice         HR   27   60000
7  1992      Bob         RD   32   52000
8  1992  Charlie      Admin   47   62000

In [21]:
# Year 컬럼의 중복제거한 유니크한 값 추출
df['Year'].unique()

array([1990, 1991, 1992])

In [26]:
df

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991    Alice         HR   26   52000
4  1991      Bob         RD   31   50000
5  1991  Charlie      Admin   46   60000
6  1992    Alice         HR   27   60000
7  1992      Bob         RD   32   52000
8  1992  Charlie      Admin   47   62000

In [22]:
## df의 집계 함수 실습

In [24]:
#  각 년도별로 연봉 총합 구하기
df.groupby('Year')['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [28]:
# 년도별로 묶되 년도가 같으면 부서별로 연봉 총합 구하기
df.groupby(['Year','Department'])['Salary'].sum()

Year  Department
1990  Admin         55000
      HR            50000
      RD            48000
1991  Admin         60000
      HR            52000
      RD            50000
1992  Admin         62000
      HR            60000
      RD            52000
Name: Salary, dtype: int64

In [29]:
# 년도별로, 연봉 총합도 보여주고, 연봉 평균도 보여달라.
df.groupby('Year')['Salary'].agg(['sum', 'mean'])

         sum     mean
Year
1990  153000  51000.0
1991  162000  54000.0
1992  174000  58000.0

In [31]:
# 카테고리컬 데이터의 데이터별로 갯수를 확인하는 방법
# select Year, count(*) from df group by Year;

df.groupby(['Year'])['Year'].count()

Year
1990    3
1991    3
1992    3
Name: Year, dtype: int64

In [32]:
# 이렇게 데이터별로  개수를 세는 것은 데이터분석에 많이 사용하므로, 전용함수가 있음.
df['Year'].value_counts()

Year
1990    3
1991    3
1992    3
Name: count, dtype: int64

In [39]:
html_url = 'https://www.livingin-canada.com/house-prices-canada.html'
df_html = pd.read_html(html_url)
type(df_html)

list

In [40]:
df_html

[                                                City  \
 0                                      Vancouver, BC
 1                                       Toronto, Ont
 2                                        Ottawa, Ont
 3                                       Calgary, Alb
 4                                      Montreal, Que
 5                                        Halifax, NS
 6                                       Regina, Sask
 7                                    Fredericton, NB
 8  (adsbygoogle = window.adsbygoogle || []).push(...

                                  Average House Price  \
 0                                         $1,036,000
 1                                           $870,000
 2                                           $479,000
 3                                           $410,000
 4                                           $435,000
 5                                           $331,000
 6                                           $254,000
 7                                           $198,000
 8  (adsbygoogle = window.adsbygoogle || []).push(...

                                      12 Month Change
 0                                           + 2.63 %
 1                                            +10.2 %
 2                                           + 15.4 %
 3                                            – 1.5 %
 4                                            + 9.3 %
 5                                            + 3.6 %
 6                                            – 3.9 %
 7                                            – 4.3 %
 8  (adsbygoogle = window.adsbygoogle || []).push(...  ,
                                              Province  \
 0                                    British Columbia
 1                                             Ontario
 2                                             Alberta
 3                                              Quebec
 4                                            Manitoba
 5                                        Saskatchewan
 6                                         Nova Scotia
 7                                Prince Edward Island
 8                             Newfoundland / Labrador
 9                                       New Brunswick
 10                                   Canadian Average
 11  (adsbygoogle = window.adsbygoogle || []).push(...

                                   Average House Price  \
 0                                            $736,000
 1                                            $594,000
 2                                            $353,000
 3                                            $340,000
 4                                            $295,000
 5                                            $271,000
 6                                            $266,000
 7                                            $243,000
 8                                            $236,000
 9                                            $183,000
 10                                           $488,000
 11  (adsbygoogle = window.adsbygoogle || []).push(...

                                       12 Month Change
 0                                             + 7.6 %
 1                                             – 3.2 %
 2                                             – 7.5 %
 3                                             + 7.6 %
 4                                             – 1.4 %
 5                                             – 3.8 %
 6                                             + 3.5 %
 7                                             + 3.0 %
 8                                             – 1.6 %
 9                                             – 2.2 %
 10                                            – 1.3 %
 11  (adsbygoogle = window.adsbygoogle || []).push(...  ]

In [41]:
len(df_html)

2

In [42]:
df_html[1]

,Province,Average House Price,12 Month Change
0,British Columbia,"$736,000",+ 7.6 %
1,Ontario,"$594,000",– 3.2 %
2,Alberta,"$353,000",– 7.5 %
3,Quebec,"$340,000",+ 7.6 %
4,Manitoba,"$295,000",– 1.4 %
5,Saskatchewan,"$271,000",– 3.8 %
6,Nova Scotia,"$266,000",+ 3.5 %
7,Prince Edward Island,"$243,000",+ 3.0 %
8,Newfoundland / Labrador,"$236,000",– 1.6 %
9,New Brunswick,"$183,000",– 2.2 %
10,Canadian Average,"$488,000",– 1.3 %
11,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [47]:
# 마지막 광고행 삭제하고 df1에 저장
df1 = df_html[0].drop(8,axis=0)

In [49]:
df_html[1].drop(11)

                   Province Average House Price 12 Month Change
0          British Columbia            $736,000         + 7.6 %
1                   Ontario            $594,000         – 3.2 %
2                   Alberta            $353,000         – 7.5 %
3                    Quebec            $340,000         + 7.6 %
4                  Manitoba            $295,000         – 1.4 %
5              Saskatchewan            $271,000         – 3.8 %
6               Nova Scotia            $266,000         + 3.5 %
7      Prince Edward Island            $243,000         + 3.0 %
8   Newfoundland / Labrador            $236,000         – 1.6 %
9             New Brunswick            $183,000         – 2.2 %
10         Canadian Average            $488,000         – 1.3 %

In [50]:
df_html[0]

,City,Average House Price,12 Month Change
0,"Vancouver, BC","$1,036,000",+ 2.63 %
1,"Toronto, Ont","$870,000",+10.2 %
2,"Ottawa, Ont","$479,000",+ 15.4 %
3,"Calgary, Alb","$410,000",– 1.5 %
4,"Montreal, Que","$435,000",+ 9.3 %
5,"Halifax, NS","$331,000",+ 3.6 %
6,"Regina, Sask","$254,000",– 3.9 %
7,"Fredericton, NB","$198,000",– 4.3 %
8,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

## PANDAS OPERATIONS

 - 어떤 조건에 맞는 데이터를 가져오는 방법

In [52]:
# 데이터 프레임 만들기
df = pd.DataFrame({'Employee ID':[111, 222, 333, 444],
                   'Employee Name':['Chanel', 'Steve', 'Mitch', 'Bird'],
                   'Salary [$/h]':[35, 29, 38, 20],
                   'Years of Experience':[3, 4 ,9, 1]})
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9
3          444          Bird            20                    1

In [53]:
# 경력이 3년 이상인 사람의 데이터를 가져오기

In [58]:
cond = df['Years of Experience'] >= 3

In [ ]:
df[df['Years of Experience'] >= 3]

In [59]:
df[cond]

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9

In [61]:
df.loc[df['Years of Experience'] >= 3, ['Employee Name', 'Salary [$/h]', 'Years of Experience']]

  Employee Name  Salary [$/h]  Years of Experience
0        Chanel            35                    3
1         Steve            29                    4
2         Mitch            38                    9

In [62]:
(df['Years of Experience'] >=3) & (df['Salary [$/h]'] >= 30)

0     True
1    False
2     True
3    False
dtype: bool

In [63]:
# 이 사람의 이름만 가져오기
df.loc[(df['Years of Experience'] >=3) & (df['Salary [$/h]'] >= 30), 'Employee Name']

0    Chanel
2     Mitch
Name: Employee Name, dtype: object

In [64]:
df.loc[(df['Years of Experience'] >=3) & (df['Salary [$/h]'] >= 30), ['Employee Name', 'Years of Experience']]

  Employee Name  Years of Experience
0        Chanel                    3
2         Mitch                    9

In [65]:
(df['Years of Experience'] <=3) | (df['Years of Experience'] >=8 )

0     True
1    False
2     True
3     True
Name: Years of Experience, dtype: bool

In [66]:
# df.loc[행, 열]
df.loc[(df['Years of Experience'] <=3) | (df['Years of Experience'] >=8 ), ['Employee Name', 'Years of Experience']]

  Employee Name  Years of Experience
0        Chanel                    3
2         Mitch                    9
3          Bird                    1

 - 시급이 가장 높은 사람의 데이터 가져오기

In [68]:
# 1. 최대값을 먼저 찾는다.
df['Salary [$/h]'].max()

np.int64(38)

In [69]:
# 2. 시급컬럼에서, 위에서 찾은 최대값과 같은 데이터를 찾음.
(df['Salary [$/h]'] == df['Salary [$/h]'].max())

0    False
1    False
2     True
3    False
Name: Salary [$/h], dtype: bool

In [70]:
# 3. 위에서 True인 행을 가져옴
df.loc[(df['Salary [$/h]'] == df['Salary [$/h]'].max()), : ]

   Employee ID Employee Name  Salary [$/h]  Years of Experience
2          333         Mitch            38                    9

## APPLYING FUNCTIONS

In [98]:
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9
3          444          Bird            20                    1

In [99]:
df['Employee Name'].str.upper()

0    CHANEL
1     STEVE
2     MITCH
3      BIRD
Name: Employee Name, dtype: object

In [105]:
df['Employee Name']= df['Employee Name'].str.lower()
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience  name_length
0          111        chanel            35                    3            6
1          222         steve            29                    4            5
2          333         mitch            38                    9            5
3          444          bird            20                    1            4

In [103]:
df['name_length'] = df['Employee Name'].str.len()
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience  name_length
0          111        Chanel            35                    3            6
1          222         Steve            29                    4            5
2          333         Mitch            38                    9            5
3          444          Bird            20                    1            4

##  SORTING(정렬)

In [71]:
df = pd.DataFrame({'Employee ID':[111, 222, 333, 444], 
                   'Employee Name':['Chanel', 'Steve', 'Mitch', 'Bird'], 
                   'Salary [$/h]':[35, 29, 38, 20], 
                   'Years of Experience':[3, 4 ,9, 1]})
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9
3          444          Bird            20                    1

In [72]:
df.columns

Index(['Employee ID', 'Employee Name', 'Salary [$/h]', 'Years of Experience'], dtype='object')

In [73]:
# 기본 : 오름 차순 
df.sort_values(by='Salary [$/h]', ascending=0)

   Employee ID Employee Name  Salary [$/h]  Years of Experience
2          333         Mitch            38                    9
0          111        Chanel            35                    3
1          222         Steve            29                    4
3          444          Bird            20                    1

In [79]:
df.sort_index(ascending=True,axis=1)

   Employee ID Employee Name  Salary [$/h]  Years of Experience
0          111        Chanel            35                    3
1          222         Steve            29                    4
2          333         Mitch            38                    9
3          444          Bird            20                    1

## CONCATENATING AND MERGING

In [81]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [82]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [84]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
index=[8, 9, 10, 11])

df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [85]:
pd.concat([df1, df2, df3], axis=0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [86]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [90]:
# 데이터 프레임 만들기
raw_data = {
        'Employee ID': ['1', '2', '3', '4', '5'],
        'first name': ['Diana', 'Cynthia', 'Shep', 'Ryan', 'Allen'], 
        'last name': ['Bouchard', 'Ali', 'Rob', 'Mitch', 'Steve']}
columns = ['Employee ID', 'first name', 'last name']
df_Engineering_dept = pd.DataFrame(raw_data, columns = columns)
df_Engineering_dept

  Employee ID first name last name
0           1      Diana  Bouchard
1           2    Cynthia       Ali
2           3       Shep       Rob
3           4       Ryan     Mitch
4           5      Allen     Steve

In [91]:
# 데이터 프레임 만들기
raw_data = {
        'Employee ID': ['6', '7', '8', '9', '10'],
        'first name': ['Bill', 'Dina', 'Sarah', 'Heather', 'Holly'], 
        'last name': ['Christian', 'Mo', 'Steve', 'Bob', 'Michelle']}
columns =  ['Employee ID', 'first name', 'last name']
df_Finance_dept = pd.DataFrame(raw_data, columns = columns)
df_Finance_dept

  Employee ID first name  last name
0           6       Bill  Christian
1           7       Dina         Mo
2           8      Sarah      Steve
3           9    Heather        Bob
4          10      Holly   Michelle

In [93]:
df_user = pd.concat([df_Engineering_dept,df_Finance_dept], axis = 0)
df_user

  Employee ID first name  last name
0           1      Diana   Bouchard
1           2    Cynthia        Ali
2           3       Shep        Rob
3           4       Ryan      Mitch
4           5      Allen      Steve
0           6       Bill  Christian
1           7       Dina         Mo
2           8      Sarah      Steve
3           9    Heather        Bob
4          10      Holly   Michelle

In [94]:
df_user

  Employee ID first name  last name
0           1      Diana   Bouchard
1           2    Cynthia        Ali
2           3       Shep        Rob
3           4       Ryan      Mitch
4           5      Allen      Steve
0           6       Bill  Christian
1           7       Dina         Mo
2           8      Sarah      Steve
3           9    Heather        Bob
4          10      Holly   Michelle

In [95]:
df_Engineering_dept

  Employee ID first name last name
0           1      Diana  Bouchard
1           2    Cynthia       Ali
2           3       Shep       Rob
3           4       Ryan     Mitch
4           5      Allen     Steve

In [96]:
# 급여 데이터 프레임
raw_data = {
        'Employee ID': ['1', '2', '3', '4', '5', '7', '8', '9', '10'],
        'Salary [$/hour]': [25, 35, 45, 48, 49, 32, 33, 34, 23]}
df_salary = pd.DataFrame(raw_data, columns = ['Employee ID','Salary [$/hour]'])
df_salary

  Employee ID  Salary [$/hour]
0           1               25
1           2               35
2           3               45
3           4               48
4           5               49
5           7               32
6           8               33
7           9               34
8          10               23

In [97]:
inner_join = pd.merge(df_Engineering_dept,df_salary, on='Employee ID', how='inner')
inner_join

  Employee ID first name last name  Salary [$/hour]
0           1      Diana  Bouchard               25
1           2    Cynthia       Ali               35
2           3       Shep       Rob               45
3           4       Ryan     Mitch               48
4           5      Allen     Steve               49

In [116]:
# 데이터 프레임 병합
inner_join = pd.merge(df_Engineering_dept, df_salary, on='Employee ID', how='left')
inner_join

  Employee ID first name last name  Salary [$/hour]
0           1      Diana  Bouchard               25
1           2    Cynthia       Ali               35
2           3       Shep       Rob               45
3           4       Ryan     Mitch               48
4           5      Allen     Steve               49

In [117]:
inner_join = pd.merge(df_Engineering_dept, df_salary, on='Employee ID', how='right')
inner_join

  Employee ID first name last name  Salary [$/hour]
0           1      Diana  Bouchard               25
1           2    Cynthia       Ali               35
2           3       Shep       Rob               45
3           4       Ryan     Mitch               48
4           5      Allen     Steve               49
5           7        NaN       NaN               32
6           8        NaN       NaN               33
7           9        NaN       NaN               34
8          10        NaN       NaN               23

In [119]:
# df_user와 df_salary left join 하기
join = pd.merge(df_user, df_salary, on='Employee ID', how ='left')
join

  Employee ID first name  last name  Salary [$/hour]
0           1      Diana   Bouchard             25.0
1           2    Cynthia        Ali             35.0
2           3       Shep        Rob             45.0
3           4       Ryan      Mitch             48.0
4           5      Allen      Steve             49.0
5           6       Bill  Christian              NaN
6           7       Dina         Mo             32.0
7           8      Sarah      Steve             33.0
8           9    Heather        Bob             34.0
9          10      Holly   Michelle             23.0

 - 조건에 따른 데이터 가공

In [107]:
# 시급이 30보다 이상이면 'A'
# 시급이 30보다 작으면 'B'
# 이렇게 새로운 컬럼 group 컬럼을 만들어서 데이터를 셋팅하세요.

In [108]:
df

   Employee ID Employee Name  Salary [$/h]  Years of Experience  name_length
0          111        chanel            35                    3            6
1          222         steve            29                    4            5
2          333         mitch            38                    9            5
3          444          bird            20                    1            4

In [109]:
# 구분 기준은  salary >= 30 ->A, 아니면 B
def get_group(salary):
    if salary >= 30:
        return 'A'
    elif salary < 30 :
        return 'B'

In [110]:
get_group(40)

'A'

In [111]:
get_group(20)

'B'

In [112]:
df['Salary [$/h]'].apply(get_group)

0    A
1    B
2    A
3    B
Name: Salary [$/h], dtype: object

In [115]:
# group 컬럼을 만들어서 df에 적용하기
df['group'] = df['Salary [$/h]'].apply(get_group)
df

,Employee ID,Employee Name,Salary [$/h],Years of Experience,name_length,group
0,111,chanel,35,3,6,A
1,222,steve,29,4,5,B
2,333,mitch,38,9,5,A
3,444,bird,20,1,4,B